[
  {
    "id": 2,
    "name": "Just Me (and sometimes someone else)",
    "writtenBy": "<p>Written, arranged and produced by Fiona Ross. <br/>Piano and Vocals by Fiona Ross.</p>",
    "images": {
      "thumb": "./images/albums/thumb/just-me.png",
      "bg": "./images/albums/bg/just-me.png",
      "appCover": "./images/albums/just-me-app-cover.png"
    },
    "comingSoon": true,
    "quotes": [
      {
        "copy": "This double album by Fiona Ross is an absolute joy to immerse oneself in. Her voice is beautifully clear and her tone vibrant. There is an absorbing honesty to her delivery and her timing and tuning are impeccable. All this forms the perfect conduit by which to deliver these intensely personal and quirky songs of love, loss and yearning. There is an incisive honesty and humanity in the detail that takes each song’s message straight to your heart. I loved the contrast in production style between the sparsely produced ‘Side 1’ and the full band performances of Side 2.",
        "author": "Ola Onabule",
        "href": "ola-onabule"
      },
      {
        "copy": "<p>The newest album by Fiona Ross, Just Me (and sometimes someone else) is a candid journey into the singers raw heart, her soul, and, indeed, her unique creative genius.  The span of the double album allows Ross to cover a lot of sonic territory.  The first disc is pared down, mainly the Just Me of the title, and Rosss voice is assured, powerful, and exudes a presence that is impossible to ignore. That voice is an exquisite instrument, intoxicating, and perfectly matched by her driving, dazzling piano. There is accompaniment on the first disc, but its minimal, just spare flashes of guitar (Gibbi Bettini), strains of subdued sax (Kris Buzow), perhaps, some judicious percussion (Marley Drummond) and bass (Nathan Williams, who also mixed the album), all hinting at the artistry to come: the second album explodes into full band, a excellent machine of virtuosic jazz musicianship.</p>",
        "author": "Garth Twa",
        "href": "garth-twa"
      }
    ]
  },
  {
    "id": 1,
    "name": "A Twist of Blue",
    "writtenBy": "<p>Written and arranged by Fiona Ross. <br/>Piano and Vocals by Fiona Ross.</p>",
    "images": {
      "thumb": "./images/albums/thumb/twist-of-blue.png",
      "bg": "./images/albums/bg/twist-of-blue.png",
      "appCover": "./images/albums/twist-of-blue-app-cover.png"
    },
    "urls": {
      "itunes": "https://geo.itunes.apple.com/gb/album/a-twist-of-blue/id1169582869?mt=1&app=music",
      "google": "https://play.google.com/store/music/album/Fiona_Ross_A_Twist_of_Blue?id=Bfol6vaou2yj7ywqsm7hcc7ssie",
      "amazon": "https://www.amazon.co.uk/dp/B01M6A1BFR"
    },
    "soundcloud": {
      "setUrl": "http://soundcloud.com/fiona-ross/sets/selection-1"
    },
    "quotes": [
      {
        "copy": "Fiona Ross sings with an irrepressibility, a skill, and a passion that is assured, confident, and sexy. There is simply nothing to compare her to.",
        "author": "Dr. Garth Twa"
      },
      {
        "copy": "A Twist of Brilliance - absolutely wonderful!",
        "author": "Tony Barnes"
      }
    ]
  }
]