[
  {
    "id": 1,
    "name": "Just Me (and sometimes someone else)",
    "releaseDate": "2001-01-20T07:39:50 -01:00",
    "images": {
      "cover": "./images/home-hero.png",
      "appCover": "./images/albums/just-me-app-cover.png"
    },
    "urls": {
      "itunes": "http://test-itunes.com",
      "google": "http://test-google.com",
      "amazon": "http://test-amazon.com"
    },
    "tracks": [
      {"title": "track title 1"},
      {"title": "track title 2"},
      {"title": "track title 3"},
      {"title": "track title 4"},
      {"title": "track title 5"},
      {"title": "track title 6"},
      {"title": "track title 7"},
      {"title": "track title 8"},
      {"title": "track title 9"},
      {"title": "track title 10"}
    ],
    "quotes": [
      {
        "copy": "Why haven't I heard of Fiona sooner?!",
        "author": "Dummy name"
      },
      {
        "copy": "Rocks my world",
        "author": "Michael Jameson"
      }
    ]
  },
  {
    "id": 2,
    "name": "A Twist of Blue",
    "releaseDate": "1999-01-20T07:39:50 -01:00",
    "images": {
      "cover": "./images/home-hero.png",
      "appCover": "./images/albums/twist-of-blue-app-cover.png"
    },
    "urls": {
      "itunes": "http://test-itunes.com",
      "google": "http://test-google.com",
      "amazon": "http://test-amazon.com"
    },
    "tracks": [
      {"title": "track title 1"},
      {"title": "track title 2"},
      {"title": "track title 3"},
      {"title": "track title 4"},
      {"title": "track title 5"},
      {"title": "track title 6"},
      {"title": "track title 7"},
      {"title": "track title 8"},
      {"title": "track title 9"},
      {"title": "track title 10"}
    ],
    "quotes": [
      {
        "copy": "It's hard to describe the new album, A Twist of Blue, by newcomer Fiona Ross. One is left disarmed of similes and metaphors, the usual writer's arsenal. There is simply nothing to compare her to. <br/>Perhaps the best way to describe Fiona Ross is by the physical reaction that occurs when first listening to her. One experiences a sense of electricity, of palpable joy. One begins to notice the unwitting grin that spreads across one's face. One is left with rubbery limps by the purity of Fiona Ross's voice. <br/>She sings with a crystalline precision. her voice is an instrument and she is an artist. She has wisely chosen the material—all originals except for two tracks—for Twist of Blue. The album runs the gamut of musical styles and she handles them all with mastery and passion, from the tropicalia bliss of ‘I Can't Help You Baby' and ‘Without You', to the confident power and dominatrix strength of ‘You Can't Control Me,' to her jaw-dropping rendition of Bessie Smith's ‘Wasted Life Blues', which, at six minutes long, still seems too short. <br/>She is a refreshing rarity who has burst onto the scene at just the right time, just when we thought we'd heard it all before. I was amazed at her technical skill—her combined talents not only as a song writer but also as a pianist and—but I fell in love with her love for music. There isn't a note that doesn't reveal her passion for music, and her passion is infectious. She also covers New York State of Mind and makes it her own, which is no small feat considering the song is somewhat of a cabaret chestnut by now. <br/>Fiona Ross sings with an irrepressibility, a skill, and a passion that is assured, confident, and sexy.",
        "author": "Unknown"
      }
    ]
  }
]